payment_methods/nimbleshop_stripe/test/vcr_cassettes/stripe/purchase-success.yml

---
http_interactions:
- request:
    method: post
    uri: https://sk_09SbpItoIMWYU8okpS23rnxIzgyW7:@api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=10048&currency=usd&card=tok_0eLPgnVqeoGqWd
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      User-Agent:
      - Stripe/v1 ActiveMerchantBindings/1.26.0
      X-Stripe-Client-User-Agent:
      - ! '{"bindings_version":"1.26.0","lang":"ruby","lang_version":"1.9.3 p125 (2012-02-16)","platform":"x86_64-darwin11.4.0","publisher":"active_merchant","uname":"Darwin
        Neeraj-Singhs-MacBook-Pro.local 11.4.2 Darwin Kernel Version 11.4.2: Thu Aug
        23 16:25:48 PDT 2012; root:xnu-1699.32.7~1/RELEASE_X86_64 x86_64"}'
      X-Stripe-Client-User-Metadata:
      - ! '{"ip":null}'
      Accept:
      - ! '*/*'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 31 Oct 2012 14:50:42 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '958'
      Connection:
      - keep-alive
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Cache-Control:
      - no-cache, no-store
    body:
      encoding: US-ASCII
      string: ! "{\n  \"amount\": 10048,\n  \"amount_refunded\": 0,\n  \"created\":
        1351695041,\n  \"currency\": \"usd\",\n  \"customer\": null,\n  \"description\":
        null,\n  \"disputed\": false,\n  \"failure_message\": null,\n  \"fee\": 321,\n
        \ \"id\": \"ch_0eLWIXVivQp0KE\",\n  \"invoice\": null,\n  \"livemode\": false,\n
        \ \"object\": \"charge\",\n  \"paid\": true,\n  \"refunded\": false,\n  \"card\":
        {\n    \"address_city\": null,\n    \"address_country\": null,\n    \"address_line1\":
        null,\n    \"address_line1_check\": null,\n    \"address_line2\": null,\n
        \   \"address_state\": null,\n    \"address_zip\": null,\n    \"address_zip_check\":
        null,\n    \"country\": \"US\",\n    \"cvc_check\": \"pass\",\n    \"exp_month\":
        12,\n    \"exp_year\": 2014,\n    \"fingerprint\": \"G1wO2gxeRcPZjwaI\",\n
        \   \"last4\": \"4242\",\n    \"name\": null,\n    \"object\": \"card\",\n
        \   \"type\": \"Visa\"\n  },\n  \"fee_details\": [\n    {\n      \"type\":
        \"stripe_fee\",\n      \"currency\": \"usd\",\n      \"amount\": 321,\n      \"application\":
        null,\n      \"description\": \"Stripe processing fees\"\n    }\n  ]\n}\n"
    http_version: 
  recorded_at: Wed, 31 Oct 2012 14:50:42 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/tokens/tok_0eLPgnVqeoGqWd
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - ! '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.7.2
      Authorization:
      - Bearer sk_09SbpItoIMWYU8okpS23rnxIzgyW7
      X-Stripe-Client-User-Agent:
      - ! '{"bindings_version":"1.7.2","lang":"ruby","lang_version":"1.9.3 p125 (2012-02-16)","platform":"x86_64-darwin11.4.0","publisher":"stripe","uname":"Darwin
        Neeraj-Singhs-MacBook-Pro.local 11.4.2 Darwin Kernel Version 11.4.2: Thu Aug
        23 16:25:48 PDT 2012; root:xnu-1699.32.7~1/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 31 Oct 2012 14:50:43 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '477'
      Connection:
      - keep-alive
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Cache-Control:
      - no-cache, no-store
    body:
      encoding: US-ASCII
      string: ! "{\n  \"created\": 1351694601,\n  \"id\": \"tok_0eLPgnVqeoGqWd\",\n
        \ \"livemode\": false,\n  \"object\": \"token\",\n  \"used\": true,\n  \"card\":
        {\n    \"address_city\": null,\n    \"address_country\": null,\n    \"address_line1\":
        null,\n    \"address_line2\": null,\n    \"address_state\": null,\n    \"address_zip\":
        null,\n    \"country\": \"US\",\n    \"exp_month\": 12,\n    \"exp_year\":
        2014,\n    \"fingerprint\": \"G1wO2gxeRcPZjwaI\",\n    \"last4\": \"4242\",\n
        \   \"name\": null,\n    \"object\": \"card\",\n    \"type\": \"Visa\"\n  }\n}\n"
    http_version: 
  recorded_at: Wed, 31 Oct 2012 14:50:43 GMT
recorded_with: VCR 2.2.5
