payment_methods/nimbleshop_stripe/test/vcr_cassettes/stripe/purchase-failure.yml

---
http_interactions:
- request:
    method: post
    uri: https://sk_09SbpItoIMWYU8okpS23rnxIzgyW7:@api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=10048&currency=usd&card=xxxxxx
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      User-Agent:
      - Stripe/v1 ActiveMerchantBindings/1.26.0
      X-Stripe-Client-User-Agent:
      - ! '{"bindings_version":"1.26.0","lang":"ruby","lang_version":"1.9.3 p125 (2012-02-16)","platform":"x86_64-darwin11.4.0","publisher":"active_merchant","uname":"Darwin
        Neeraj-Singhs-MacBook-Pro.local 11.4.2 Darwin Kernel Version 11.4.2: Thu Aug
        23 16:25:48 PDT 2012; root:xnu-1699.32.7~1/RELEASE_X86_64 x86_64"}'
      X-Stripe-Client-User-Metadata:
      - ! '{"ip":null}'
      Accept:
      - ! '*/*'
  response:
    status:
      code: 400
      message: Bad Request
    headers:
      Server:
      - nginx
      Date:
      - Wed, 31 Oct 2012 14:56:00 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '100'
      Connection:
      - keep-alive
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Cache-Control:
      - no-cache, no-store
    body:
      encoding: US-ASCII
      string: ! "{\n  \"error\": {\n    \"message\": \"Invalid token id: xxxxxx\",\n
        \   \"type\": \"invalid_request_error\"\n  }\n}\n"
    http_version: 
  recorded_at: Wed, 31 Oct 2012 14:56:00 GMT
recorded_with: VCR 2.2.5
